# Test `sqlalchemy`, `sqlite` and `pandas` Integration

An example of the three tools hanging together. Very straightforward.

In [1]:
!rm test.db

rm: cannot remove 'test.db': No such file or directory

In [2]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

sql_db = create_engine('sqlite:///test.db')

In [3]:
data = pd.DataFrame({'test_a': np.random.normal(1,0.05,100), 'test_b': np.random.normal(1,0.05,100)})
data.to_sql(name = 'test', con = sql_db, if_exists = 'replace', index = False)

In [4]:
test_a_limit = 1.05

my_query = "SELECT * FROM test WHERE test_a > " + str(test_a_limit) + " LIMIT 5"

pd.read_sql(my_query, con = sql_db)

     test_a    test_b
0  1.078580  0.976650
1  1.099821  0.972439
2  1.058839  1.076825
3  1.056588  0.864807
4  1.083837  1.072516